zlgopen/ametal/soc/mm32/mm32l073/mm32l073_pin.h
/*******************************************************************************
*                                 AMetal
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2018 Guangzhou ZHIYUAN Electronics Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg.cn/
*******************************************************************************/

/**
 * \file
 * \brief MM32L073 GPIO 引脚配置参数定义
 *
 * \note: 配置引脚功能的时候一定要同时配置引脚的模式，如上下拉模式、推挽模式等
 *
 * \internal
 * \par Modification History
 * - 1.00 17-04-07  nwt, first implementation
 * \endinternal
 */

#ifndef __MM32L073_PIN_H
#define __MM32L073_PIN_H

#ifdef __cplusplus
extern "C" {
#endif

#include "am_mm32l073_gpio_util.h"

 /**
 * \addtogroup mm32l073_if_pin
 * \copydoc mm32l073_pin.h
 * @{
 */

/**
 * \name MM32L073 GPIO 引脚编号
 * \anchor grp_gpio_pin_number
 * @{
 */

#define PIOA            0         /**< \brief 端口A引脚起始号 */
#define PIOA_0          0         /**< \brief PIOA_0 引脚号 */
#define PIOA_1          1         /**< \brief PIOA_1 引脚号 */
#define PIOA_2          2         /**< \brief PIOA_2 引脚号 */
#define PIOA_3          3         /**< \brief PIOA_3 引脚号 */
#define PIOA_4          4         /**< \brief PIOA_4 引脚号 */
#define PIOA_5          5         /**< \brief PIOA_5 引脚号 */
#define PIOA_6          6         /**< \brief PIOA_6 引脚号 */
#define PIOA_7          7         /**< \brief PIOA_7 引脚号 */
#define PIOA_8          8         /**< \brief PIOA_8 引脚号 */
#define PIOA_9          9         /**< \brief PIOA_9 引脚号 */
#define PIOA_10         10        /**< \brief PIOA_10 引脚号 */
#define PIOA_11         11        /**< \brief PIOA_11 引脚号 */
#define PIOA_12         12        /**< \brief PIOA_13 引脚号 */
#define PIOA_13         13        /**< \brief PIOA_13 引脚号 */
#define PIOA_14         14        /**< \brief PIOA_14 引脚号 */
#define PIOA_15         15        /**< \brief PIOA_15 引脚号 */

#define PIOB            16        /**< \brief 端口B引脚起始号 */
#define PIOB_0          16        /**< \brief PIOB_8 引脚号 */
#define PIOB_1          17        /**< \brief PIOB_1 引脚号 */
#define PIOB_2          18        /**< \brief PIOB_2 引脚号 */
#define PIOB_3          19        /**< \brief PIOB_3 引脚号 */
#define PIOB_4          20        /**< \brief PIOB_4 引脚号 */
#define PIOB_5          21        /**< \brief PIOB_5 引脚号 */
#define PIOB_6          22        /**< \brief PIOB_3 引脚号 */
#define PIOB_7          23        /**< \brief PIOB_4 引脚号 */
#define PIOB_8          24        /**< \brief PIOB_5 引脚号 */
#define PIOB_9          25        /**< \brief PIOB_5 引脚号 */
#define PIOB_10         26        /**< \brief PIOB_10引脚号 */
#define PIOB_11         27        /**< \brief PIOB_11引脚号 */
#define PIOB_12         28        /**< \brief PIOB_12引脚号 */
#define PIOB_13         29        /**< \brief PIOB_13引脚号 */
#define PIOB_14         30        /**< \brief PIOB_14引脚号 */
#define PIOB_15         31        /**< \brief PIOB_15引脚号 */

#define PIOC            32        /**< \brief 端口C引脚起始号 */
#define PIOC_13         45        /**< \brief PIOC_13引脚号 */
#define PIOC_14         46        /**< \brief PIOC_14引脚号 */
#define PIOC_15         47        /**< \brief PIOC_15引脚号 */

#define PIOD            48        /**< \brief 端口D引脚起始号 */
#define PIOD_0          48        /**< \brief PIOD_0引脚号 */
#define PIOD_1          49        /**< \brief PIOD_1引脚号 */
#define PIOD_2          50        /**< \brief PIOD_2引脚号 */
#define PIOD_3          51        /**< \brief PIOD_3引脚号 */

/**
 * \brief 引脚数目为39
 */
#define PIN_NUM         39

/**
 * \brief 支持同时发生最大引脚中断数是16
 */
#define PIN_INT_MAX     16

/** @} */

/**
 * \name MM32L073引脚定义,除调试引脚SWCK、SWIO之外，所有引脚复位时都默认为GPIO功能(浮空输入)
 * @{
 */

/******************************************************************************/

/**
 * \name PIOA_0引脚复用功能
 * @{
 */

#define PIOA_0_UART2_CTS      AM_MM32L073_GPIO_FUNC_CODE(0x01)   /**< \brief UART2_CTS */
#define PIOA_0_TIM2_CH1_ETR   AM_MM32L073_GPIO_FUNC_CODE(0x02)   /**< \brief TIM2_CH1_ETR */
#define PIOA_0_COMP1_OUT      AM_MM32L073_GPIO_FUNC_CODE(0x07)   /**< \brief COMP1_OUT */
#define PIOA_0_ADC_IN0        AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief ADC_IN0 */
#define PIOA_0_GPIO           AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOA_0引脚复用时功能模式
 * @{
 */

#define PIOA_0_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_0_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_0_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_0_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_0_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_0_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_0_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_0_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_0引脚响应速率
 * @{
 */

#define PIOA_0_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOA_0_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOA_0_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_1引脚复用功能
 * @{
 */

#define PIOA_1_UART2_RTS      AM_MM32L073_GPIO_FUNC_CODE(0x01)   /**< \brief UART2_RTS */
#define PIOA_1_TIM2_CH2       AM_MM32L073_GPIO_FUNC_CODE(0x02)   /**< \brief TIM2_CH2 */
#define PIOA_1_ADC_IN1        AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief ADC_IN1 */
#define PIOA_1_GPIO           AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOA_1引脚复用时功能模式
 * @{
 */

#define PIOA_1_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_1_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_1_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_1_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_1_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_1_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_1_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_1_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_1引脚响应速率
 * @{
 */

