zlgopen/ametal/soc/mm32/mm32l073/mm32l073_pin.h
#define PIOA_8_MCO            AM_MM32L073_GPIO_FUNC_CODE(0x00)   /**< \brief MCO */
#define PIOA_8_TIM1_CH1       AM_MM32L073_GPIO_FUNC_CODE(0x02)   /**< \brief TIM1_CH1 */
#define PIOA_8_CRS_SYNC       AM_MM32L073_GPIO_FUNC_CODE(0x04)   /**< \brief CRS_SYNC */
#define PIOA_8_GPIO           AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOA_8引脚复用时功能模式
 * @{
 */

#define PIOA_8_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_8_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_8_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_8_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_8_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_8_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_8_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_8_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_8引脚响应速率
 * @{
 */

#define PIOA_8_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOA_8_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOA_8_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_9引脚复用功能
 * @{
 */

#define PIOA_9_UART1_TX       AM_MM32L073_GPIO_FUNC_CODE(0x01)   /**< \brief UART1_TX */
#define PIOA_9_TIM1_CH2       AM_MM32L073_GPIO_FUNC_CODE(0x02)   /**< \brief TIM2_CH2 */
#define PIOA_9_UART1_RX       AM_MM32L073_GPIO_FUNC_CODE(0x03)   /**< \brief UART1_RX */
#define PIOA_9_I2C_SCL        AM_MM32L073_GPIO_FUNC_CODE(0x04)   /**< \brief I2C_SCL */
#define PIOA_9_MCO            AM_MM32L073_GPIO_FUNC_CODE(0x05)   /**< \brief MCO */
#define PIOA_9_GPIO           AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */
/** @} */

/**
 * \name PIOA_9引脚复用时功能模式
 * @{
 */

#define PIOA_9_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_9_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_9_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_9_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_9_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_9_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_9_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_9_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_9引脚响应速率
 * @{
 */

#define PIOA_9_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOA_9_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOA_9_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_10引脚复用功能
 * @{
 */

#define PIOA_10_TIM17_BKIN     AM_MM32L073_GPIO_FUNC_CODE(0x00)   /**< \brief TIM17_BKIN */
#define PIOA_10_UART1_RX       AM_MM32L073_GPIO_FUNC_CODE(0x01)   /**< \brief UART1_RX */
#define PIOA_10_TIM1_CH3       AM_MM32L073_GPIO_FUNC_CODE(0x02)   /**< \brief TIM1_CH3 */
#define PIOA_10_UART1_TX       AM_MM32L073_GPIO_FUNC_CODE(0x03)   /**< \brief UART1_TX */
#define PIOA_10_I2C_SDA        AM_MM32L073_GPIO_FUNC_CODE(0x04)   /**< \brief I2C_SDA */
#define PIOA_10_GPIO           AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */
/** @} */

/**
 * \name PIOA_10引脚复用时功能模式
 * @{
 */

#define PIOA_10_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_10_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_10_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_10_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_10_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_10_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_10_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_10_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_10引脚响应速率
 * @{
 */

#define PIOA_10_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOA_10_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOA_10_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_11引脚复用功能
 * @{
 */

#define PIOA_11_UART1_CTS      AM_MM32L073_GPIO_FUNC_CODE(0x01)   /**< \brief UART1_CTS */
#define PIOA_11_TIM1_CH4       AM_MM32L073_GPIO_FUNC_CODE(0x02)   /**< \brief TIM1_CH4 */
#define PIOA_11_I2C_SCL        AM_MM32L073_GPIO_FUNC_CODE(0x05)   /**< \brief I2C_SCL */
#define PIOA_11_COMP1_OUT      AM_MM32L073_GPIO_FUNC_CODE(0x07)   /**< \brief COMP1_OUT */
#define PIOA_11_GPIO           AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOA_11引脚复用时功能模式
 * @{
 */

#define PIOA_11_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_11_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_11_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_11_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_11_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_11_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_11_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_11_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_11引脚响应速率
 * @{
 */

#define PIOA_11_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOA_11_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOA_11_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_12引脚复用功能
 * @{
 */

#define PIOA_12_UART1_RTS      AM_MM32L073_GPIO_FUNC_CODE(0x01)   /**< \brief UART1_RTS */
#define PIOA_12_TIM1_ETR       AM_MM32L073_GPIO_FUNC_CODE(0x02)   /**< \brief TIM1_ETR */
#define PIOA_12_I2C_SDA        AM_MM32L073_GPIO_FUNC_CODE(0x05)   /**< \brief I2C_SDA */
#define PIOA_12_COMP2_OUT      AM_MM32L073_GPIO_FUNC_CODE(0x07)   /**< \brief COMP2_OUT */
#define PIOA_12_GPIO           AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOA_12引脚复用时功能模式
 * @{
 */

#define PIOA_12_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_12_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_12_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_12_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_12_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_12_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_12_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_12_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_12引脚响应速率
 * @{
 */

#define PIOA_12_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOA_12_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOA_12_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_13引脚复用功能
 * @{
 */

#define PIOA_13_SWDIO          AM_MM32L073_GPIO_FUNC_CODE(0x00)   /**< \brief SWDIO */
#define PIOA_13_GPIO           AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOA_13引脚复用时功能模式
 * @{
 */

#define PIOA_13_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_13_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_13_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_13_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_13_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_13_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_13_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_13_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_13引脚响应速率
 * @{
 */

