zlgopen/ametal/soc/mm32/mm32l073/mm32l073_pin.h
#define PIOA_13_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOA_13_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOA_13_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_14引脚复用功能
 * @{
 */

#define PIOA_14_SWDCLK         AM_MM32L073_GPIO_FUNC_CODE(0x00)   /**< \brief SWDCLK */
#define PIOA_14_UART2_TX       AM_MM32L073_GPIO_FUNC_CODE(0x01)   /**< \brief UART2_TX */
#define PIOA_14_GPIO           AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOA_14引脚复用时功能模式
 * @{
 */

#define PIOA_14_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_14_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_14_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_14_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_14_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_14_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_14_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_14_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_14引脚响应速率
 * @{
 */

#define PIOA_14_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOA_14_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOA_14_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_15引脚复用功能
 * @{
 */

#define PIOA_15_SPI1_NSS       AM_MM32L073_GPIO_FUNC_CODE(0x01)   /**< \brief SPI1_NSS */
#define PIOA_15_UART2_RX       AM_MM32L073_GPIO_FUNC_CODE(0x01)   /**< \brief UART2_RX */
#define PIOA_15_TIM2_CH1_ETR   AM_MM32L073_GPIO_FUNC_CODE(0x02)   /**< \brief TIM2_CH1_ETR */
#define PIOA_15_GPIO           AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOA_15引脚复用时功能模式
 * @{
 */

#define PIOA_15_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_15_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_15_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_15_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_15_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_15_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_15_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_15_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_15引脚响应速率
 * @{
 */

#define PIOA_15_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOA_15_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOA_15_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_0引脚复用功能
 * @{
 */

#define PIOB_0_TIM3_CH3        AM_MM32L073_GPIO_FUNC_CODE(0x01)   /**< \brief TIM3_CH3 */
#define PIOB_0_TIM1_CH2N       AM_MM32L073_GPIO_FUNC_CODE(0x02)   /**< \brief TIM1_CH2N */
#define PIOB_0_ADC_IN8         AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief ADC_IN8 */
#define PIOB_0_GPIO            AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOB_8引脚复用时功能模式
 * @{
 */

#define PIOB_0_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_0_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOB_0_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_0_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_0_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_0_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_0_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_0_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_0引脚响应速率
 * @{
 */

#define PIOB_0_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOB_0_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOB_0_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_1引脚复用功能
 * @{
 */

#define PIOB_1_TIM14_CH1      AM_MM32L073_GPIO_FUNC_CODE(0x00)   /**< \brief TIM14_CH1 */
#define PIOB_1_TIM3_CH4       AM_MM32L073_GPIO_FUNC_CODE(0x01)   /**< \brief TIM3_CH4 */
#define PIOB_1_TIM1_CH3N      AM_MM32L073_GPIO_FUNC_CODE(0x02)   /**< \brief TIM1_CH3N */
#define PIOB_1_ADC_IN9        AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief ADC_IN9 */
#define PIOB_1_GPIO           AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOB_1引脚复用时功能模式
 * @{
 */

#define PIOB_1_AIN           AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_1_INPUT_FLOAT   AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOB_1_INPUT_PD      AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_1_INPUT_PU      AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_1_OUT_PP        AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_1_OUT_OD        AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_1_AF_PP         AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_1_AF_OD         AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_1引脚响应速率
 * @{
 */

#define PIOB_1_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOB_1_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOB_1_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_2引脚复用功能
 * @{
 */

#define PIOB_2_GPIO           AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOB_2引脚复用时功能模式
 * @{
 */

#define PIOB_2_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_2_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOB_2_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_2_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_2_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_2_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_2_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_2_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_2引脚响应速率
 * @{
 */

