zlgopen/ametal/soc/mm32/mm32l073/mm32l073_pin.h
#define PIOB_15_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOB_15_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOB_15_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOC_13引脚复用功能
 * @{
 */
#define PIOC_13_GPIO            AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOC_13引脚复用时功能模式
 * @{
 */

#define PIOC_13_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOC_13_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOC_13_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOC_13_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOC_13_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOC_13_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOC_13_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOC_13_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOC_13引脚响应速率
 * @{
 */

#define PIOC_13_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOC_13_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOC_13_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOC_14引脚复用功能
 * @{
 */
#define PIOC_14_GPIO            AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOC_14引脚复用时功能模式
 * @{
 */

#define PIOC_14_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOC_14_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOC_14_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOC_14_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOC_14_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOC_14_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOC_14_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOC_14_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOC_14引脚响应速率
 * @{
 */

#define PIOC_14_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOC_14_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOC_14_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOC_15引脚复用功能
 * @{
 */
#define PIOC_15_GPIO            AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOC_15引脚复用时功能模式
 * @{
 */

#define PIOC_15_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOC_15_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOC_15_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOC_15_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOC_15_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOC_15_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOC_15_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOC_15_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOC_15引脚响应速率
 * @{
 */

#define PIOC_15_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOC_15_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOC_15_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOD_0引脚复用功能
 * @{
 */

#define PIOD_0_CRS_SYNC       AM_MM32L073_GPIO_FUNC_CODE(0x00)   /**< \brief CRS_SYNC */
#define PIOD_0_I2C_SDA        AM_MM32L073_GPIO_FUNC_CODE(0x01)   /**< \brief I2C_SDA */
#define PIOD_0_GPIO           AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOD_0引脚复用时功能模式
 * @{
 */

#define PIOD_0_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOD_0_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOD_0_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOD_0_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOD_0_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOD_0_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOD_0_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOD_0_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOD_0引脚响应速率
 * @{
 */

#define PIOD_0_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOD_0_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOD_0_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOD_1引脚复用功能
 * @{
 */

#define PIOD_1_I2C_SCL        AM_MM32L073_GPIO_FUNC_CODE(0x01)   /**< \brief I2C_SCL */
#define PIOD_1_GPIO           AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOD_1引脚复用时功能模式
 * @{
 */

#define PIOD_1_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOD_1_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOD_1_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOD_1_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOD_1_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOD_1_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOD_1_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOD_1_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOD_1引脚响应速率
 * @{
 */

