zlgopen/ametal/soc/mm32/mm32l073/mm32l073_pin.h
#define PIOD_1_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOD_1_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOD_1_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOD_2引脚复用功能
 * @{
 */

#define PIOD_2_GPIO           AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOD_2引脚复用时功能模式
 * @{
 */

#define PIOD_2_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOD_2_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOD_2_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOD_2_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOD_2_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOD_2_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOD_2_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOD_2_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOD_2引脚响应速率
 * @{
 */

#define PIOD_2_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOD_2_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOD_2_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOD_3引脚复用功能
 * @{
 */

#define PIOD_3_GPIO           AM_MM32L073_GPIO_FUNC_CODE(0x0F)   /**< \brief GPIO */

/** @} */

/**
 * \name PIOD_3引脚复用时功能模式
 * @{
 */

#define PIOD_3_AIN            AM_MM32L073_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOD_3_INPUT_FLOAT    AM_MM32L073_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOD_3_INPUT_PD       AM_MM32L073_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOD_3_INPUT_PU       AM_MM32L073_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOD_3_OUT_PP         AM_MM32L073_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOD_3_OUT_OD         AM_MM32L073_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOD_3_AF_PP          AM_MM32L073_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOD_3_AF_OD          AM_MM32L073_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOD_3引脚响应速率
 * @{
 */

#define PIOD_3_SPEED_10MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 10MHz输出响应速率 */
#define PIOD_3_SPEED_20MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 20MHz输出响应速率 */
#define PIOD_3_SPEED_50MHz    AM_MM32L073_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * @}
 */

/**
 * @}if_mm32l073_pin
 */

#ifdef __cplusplus
}
#endif

#endif /* __MM32L073_PIN_H */

/* end of file */
